[
    {
        "index": 0,
        "Simulation_Description": "Animate the ball's motion from the throw to the peak and back to the initial level."
    },
    {
        "index": 1,
        "Simulation_Description": "A simulation video showing the block moving across the surface with force vectors and work done being displayed in real-time."
    },
    {
        "index": 2,
        "Simulation_Description": "A simulation video showing the melting of ice and the temperature change in the water, including real-time temperature monitoring."
    },
    {
        "index": 3,
        "Simulation_Description": "visualize the static electric field and show the field strength variation with distance."
    },
    {
        "index": 4,
        "Simulation_Description": "Animate the car's acceleration from rest to 20  meter per second , highlighting the change in speed over time."
    },
    {
        "index": 5,
        "Simulation_Description": "A video simulation depicting the projectile's motion in real-time, including a graph overlay of height versus time and distance versus time."
    },
    {
        "index": 6,
        "Simulation_Description": "A simulation video showing the block moving across the surface with force vectors and work done being displayed in real-time."
    },
    {
        "index": 7,
        "Simulation_Description": "A simulation video showing the melting of ice and the temperature change in the water, including real-time temperature monitoring."
    },
    {
        "index": 8,
        "Simulation_Description": "A simulation video showing the car decelerating to a stop over 5 seconds with force vectors and speed-time graph."
    },
    {
        "index": 9,
        "Simulation_Description": "A simulation video depicting the interaction between the two charges, showing the force vectors and the resulting motion if allowed to move."
    },
    {
        "index": 10,
        "Simulation_Description": "A simulation video showing the ball moving in a circle with force vectors and real-time tension calculation."
    },
    {
        "index": 11,
        "Simulation_Description": "A simulation video showing the pendulum's oscillatory motion, with real-time period calculation and phase diagram."
    },
    {
        "index": 12,
        "Simulation_Description": "A simulation video of the Carnot engine cycle, including the temperature changes and efficiency calculation."
    },
    {
        "index": 13,
        "Simulation_Description": "A simulation video showing the object moving with its kinetic energy being calculated and displayed in real-time."
    },
    {
        "index": 14,
        "Simulation_Description": "A simulation video showing the motion of the two blocks, the force applied, and the tension in the string, with real-time acceleration calculations."
    },
    {
        "index": 15,
        "Simulation_Description": "A simulation video illustrating the reflection of light from the plane mirror, showing the incident and reflected angles in real-time."
    },
    {
        "index": 16,
        "Simulation_Description": "A simulation video demonstrating the change in the magnetic field, the resulting change in magnetic flux, and the induced emf in the coil."
    },
    {
        "index": 17,
        "Simulation_Description": "A simulation video showing the rod held horizontally with the torque vector and real-time calculations."
    },
    {
        "index": 18,
        "Simulation_Description": "A simulation video illustrating the refraction of light at the boundary between air and water, showing real-time angle measurements."
    },
    {
        "index": 19,
        "Simulation_Description": "A simulation video depicting the gravitational attraction between the two masses, with real-time force calculation."
    },
    {
        "index": 20,
        "Simulation_Description": "A simulation video illustrating the expansion process of the gas in the cylinder, showing real-time work done calculations."
    },
    {
        "index": 21,
        "Simulation_Description": "A simulation video showing the object on the inclined plane, with force vectors and real-time calculations of the parallel force component."
    },
    {
        "index": 22,
        "Simulation_Description": "A simulation video showing the electric field around the point charge, with real-time electric field magnitude calculation at various distances."
    },
    {
        "index": 23,
        "Simulation_Description": "A simulation video illustrating the current flow in the series circuit, with real-time current calculation and voltage drop across each resistor."
    },
    {
        "index": 24,
        "Simulation_Description": "A simulation video showing the mass-spring system oscillating, with real-time period calculation and position-time graph."
    },
    {
        "index": 25,
        "Simulation_Description": "A simulation video illustrating the wave traveling along the string, with real-time calculations of wavelength, frequency, and speed."
    },
    {
        "index": 26,
        "Simulation_Description": "A simulation video demonstrating the compression and release of the spring, with real-time potential energy calculation."
    },
    {
        "index": 27,
        "Simulation_Description": "A simulation video illustrating the current flowing through the resistor and the real-time power dissipation calculation."
    },
    {
        "index": 28,
        "Simulation_Description": "A simulation video illustrating the circular motion of the mass, with real-time centripetal force calculation."
    },
    {
        "index": 29,
        "Simulation_Description": "A simulation video illustrating the collision and embedding process, with real-time calculations of the final velocity."
    },
    {
        "index": 30,
        "Simulation_Description": "A simulation video illustrating the motion of the charged particle in the magnetic field, showing the real-time calculation of the magnetic force."
    },
    {
        "index": 31,
        "Simulation_Description": "A simulation video illustrating the object's motion and real-time kinetic energy calculation."
    },
    {
        "index": 32,
        "Simulation_Description": "A simulation video illustrating the propagation of the sound wave, showing real-time speed calculation."
    },
    {
        "index": 33,
        "Simulation_Description": "A simulation video illustrating the wire in the magnetic field, showing real-time force calculation."
    },
    {
        "index": 34,
        "Simulation_Description": "A simulation video illustrating the car's motion with real-time distance calculation."
    },
    {
        "index": 35,
        "Simulation_Description": "A simulation video illustrating the current flow through the parallel resistors and the real-time calculation of equivalent resistance."
    },
    {
        "index": 36,
        "Simulation_Description": "A simulation video illustrating the object being lifted to height h and real-time potential energy calculation."
    },
    {
        "index": 37,
        "Simulation_Description": "A simulation video illustrating the gas expansion process with real-time work calculation."
    },
    {
        "index": 38,
        "Simulation_Description": "A simulation video illustrating the refraction of light at the air-water interface with real-time angle calculation."
    },
    {
        "index": 39,
        "Simulation_Description": "A simulation video illustrating the projectile's motion with real-time height calculation."
    },
    {
        "index": 40,
        "Simulation_Description": "A simulation video illustrating the capacitor with real-time capacitance calculation."
    },
    {
        "index": 41,
        "Simulation_Description": "A simulation video illustrating the object's motion with real-time momentum calculation."
    },
    {
        "index": 42,
        "Simulation_Description": "A simulation video illustrating the pendulum's motion with real-time period calculation."
    },
    {
        "index": 43,
        "Simulation_Description": "A simulation video illustrating the object's motion with real-time acceleration calculation."
    },
    {
        "index": 44,
        "Simulation_Description": "A simulation video illustrating the electric field around the point charge with real-time potential calculation."
    },
    {
        "index": 45,
        "Simulation_Description": "A simulation video illustrating the spring being compressed and the potential energy calculation."
    },
    {
        "index": 46,
        "Simulation_Description": "A simulation video illustrating the ladder's position and the real-time height calculation."
    },
    {
        "index": 47,
        "Simulation_Description": "A simulation video illustrating the magnetic field formation at the center of the loop."
    },
    {
        "index": 48,
        "Simulation_Description": "A simulation video illustrating the block sliding down the incline and the real-time speed calculation."
    },
    {
        "index": 49,
        "Simulation_Description": "A simulation video illustrating the oscillation of the mass with real-time velocity calculation."
    },
    {
        "index": 50,
        "Simulation_Description": "A simulation video illustrating the heating process of water with real-time heat calculation."
    },
    {
        "index": 51,
        "Simulation_Description": "A simulation video illustrating the lifting of the object with real-time force calculation."
    },
    {
        "index": 52,
        "Simulation_Description": "A simulation video illustrating the car's acceleration with real-time power calculation."
    },
    {
        "index": 53,
        "Simulation_Description": "A simulation video illustrating the electric force interaction between the charges."
    },
    {
        "index": 54,
        "Simulation_Description": "A simulation video illustrating the reflection in the mirror with the calculated mirror height."
    },
    {
        "index": 55,
        "Simulation_Description": "A simulation video illustrating the block being pushed across the surface with real-time acceleration calculation."
    },
    {
        "index": 56,
        "Simulation_Description": "A simulation video illustrating the light traveling from the Sun to Earth with real-time time calculation."
    },
    {
        "index": 57,
        "Simulation_Description": "A simulation video illustrating the gas behavior in the container with real-time mole calculation."
    },
    {
        "index": 58,
        "Simulation_Description": "A simulation video illustrating the photon with real-time wavelength calculation."
    },
    {
        "index": 59,
        "Simulation_Description": "A simulation video illustrating the charge moving between the points with real-time work calculation."
    },
    {
        "index": 60,
        "Simulation_Description": "A simulation video illustrating the rod's rotation with real-time linear velocity calculation."
    },
    {
        "index": 61,
        "Simulation_Description": "A simulation video illustrating the car's motion and the calculation of distance traveled."
    },
    {
        "index": 62,
        "Simulation_Description": "A simulation video illustrating the block's motion with real-time acceleration calculation."
    },
    {
        "index": 63,
        "Simulation_Description": "A simulation video illustrating the pendulum's motion and the calculation of maximum kinetic energy."
    },
    {
        "index": 64,
        "Simulation_Description": "A simulation video illustrating the ball falling and the calculation of force upon impact."
    },
    {
        "index": 65,
        "Simulation_Description": "A simulation video illustrating the ladder's position and the calculation of height at the wall."
    },
    {
        "index": 66,
        "Simulation_Description": "A simulation video illustrating the block sliding down the incline and the calculation of speed at the bottom."
    },
    {
        "index": 67,
        "Simulation_Description": "A simulation video illustrating the motion of the simple pendulum and the calculation of its period."
    },
    {
        "index": 68,
        "Simulation_Description": "A simulation video illustrating the block being pulled across the surface with real-time acceleration calculation."
    },
    {
        "index": 69,
        "Simulation_Description": "A simulation video illustrating the engine's operation and the calculation of power output."
    },
    {
        "index": 70,
        "Simulation_Description": "A simulation video illustrating the object falling and the calculation of velocity just before hitting the ground."
    },
    {
        "index": 71,
        "Simulation_Description": "A simulation video illustrating the sound wave and the calculation of wavelength."
    },
    {
        "index": 72,
        "Simulation_Description": "A simulation video illustrating the baseball's motion and the calculation of its kinetic energy."
    },
    {
        "index": 73,
        "Simulation_Description": "A simulation video illustrating the bullet's trajectory and the calculation of its momentum."
    },
    {
        "index": 74,
        "Simulation_Description": "A simulation video illustrating the charges and the calculation of electric force between them."
    },
    {
        "index": 75,
        "Simulation_Description": "A simulation video illustrating the object being lifted and the calculation of gravitational potential energy."
    },
    {
        "index": 76,
        "Simulation_Description": "A simulation video illustrating the cart's motion and the calculation of average acceleration."
    },
    {
        "index": 77,
        "Simulation_Description": "A simulation video of the block sliding down the inclined plane with real-time calculation of acceleration."
    },
    {
        "index": 78,
        "Simulation_Description": "A simulation video showing the wheel's rotation and the calculation of angular velocity."
    },
    {
        "index": 79,
        "Simulation_Description": "A simulation video illustrating the circuit operation and the calculation of current."
    },
    {
        "index": 80,
        "Simulation_Description": "A simulation video illustrating the charging of the capacitor and the calculation of stored energy."
    },
    {
        "index": 81,
        "Simulation_Description": "A simulation video illustrating the refraction of light at the air-glass interface and the calculation of the angle of refraction."
    },
    {
        "index": 82,
        "Simulation_Description": "A simulation video illustrating the magnetic field generation around the circular loop."
    },
    {
        "index": 83,
        "Simulation_Description": "A simulation video illustrating the sound wave traveling through air and the calculation of its wavelength."
    },
    {
        "index": 84,
        "Simulation_Description": "A simulation video illustrating the oscillation of the mass-spring system and the calculation of the period."
    },
    {
        "index": 85,
        "Simulation_Description": "A simulation video illustrating the pendulum's motion from release to the lowest point and the calculation of maximum speed."
    },
    {
        "index": 86,
        "Simulation_Description": "A simulation video illustrating the wire in the magnetic field and the resulting magnetic force."
    },
    {
        "index": 87,
        "Simulation_Description": "A simulation video illustrating the operation of the heat engine and the calculation of its efficiency."
    },
    {
        "index": 88,
        "Simulation_Description": "A simulation video illustrating the heat transfer process between the ice and water until thermal equilibrium is reached."
    },
    {
        "index": 89,
        "Simulation_Description": "A simulation video illustrating the ball's upward motion, reaching maximum height, and returning to the ground."
    },
    {
        "index": 90,
        "Simulation_Description": "A simulation video illustrating the electric field between the plates and the calculation of capacitance."
    },
    {
        "index": 91,
        "Simulation_Description": "A simulation video illustrating the refraction of light at the water-air interface and the calculation of the angle of refraction."
    },
    {
        "index": 92,
        "Simulation_Description": "A simulation video illustrating the object's motion up the incline until it stops and the calculation of the distance traveled."
    },
    {
        "index": 93,
        "Simulation_Description": "A simulation video illustrating the series circuit operation and the calculation of total resistance and current."
    },
    {
        "index": 94,
        "Simulation_Description": "A simulation video illustrating the magnetic field inside the solenoid and the calculation process."
    },
    {
        "index": 95,
        "Simulation_Description": "A simulation video illustrating the cart's motion and the calculation of the restoring force."
    },
    {
        "index": 96,
        "Simulation_Description": "A simulation video illustrating the object's free fall and the calculation of its final velocity."
    },
    {
        "index": 97,
        "Simulation_Description": "A simulation video illustrating the block's motion down the incline and the calculation of its acceleration."
    },
    {
        "index": 98,
        "Simulation_Description": "A simulation video illustrating the parallel circuit operation and the calculation of the equivalent resistance."
    },
    {
        "index": 99,
        "Simulation_Description": "A simulation video illustrating the heat absorption by the ice cube and the calculation of the amount of ice melted."
    },
    {
        "index": 100,
        "Simulation_Description": "A simulation video illustrating the object-lens-image system and the calculation of the image distance."
    },
    {
        "index": 101,
        "Simulation_Description": "A simulation video illustrating the ball's upward motion and the calculation of the time to reach the highest point."
    },
    {
        "index": 102,
        "Simulation_Description": "A simulation video illustrating the mass's circular motion and the calculation of the tension in the string."
    },
    {
        "index": 103,
        "Simulation_Description": "A simulation video illustrating the pressure increase with depth in the ocean and the calculation process."
    },
    {
        "index": 104,
        "Simulation_Description": "A simulation video illustrating the interaction between the two charges and the calculation of the electric force."
    },
    {
        "index": 105,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the mass and the calculation of its frequency."
    },
    {
        "index": 106,
        "Simulation_Description": "A simulation video illustrating the magnetic field generated by the current in the wire and the calculation process."
    },
    {
        "index": 107,
        "Simulation_Description": "A simulation video illustrating the ball's upward motion and the calculation of its maximum height."
    },
    {
        "index": 108,
        "Simulation_Description": "A simulation video illustrating the magnetic field generated by the semicircular wire and the calculation process."
    },
    {
        "index": 109,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the block and the calculation of its maximum speed."
    },
    {
        "index": 110,
        "Simulation_Description": "A simulation video illustrating the motion of the block under the influence of the applied force and the calculation of its acceleration."
    },
    {
        "index": 111,
        "Simulation_Description": "A simulation video illustrating the magnetic field generated by the current in the wire and the calculation process."
    },
    {
        "index": 112,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the block and the calculation of its maximum speed."
    },
    {
        "index": 113,
        "Simulation_Description": "A simulation video illustrating the horizontal motion of the ball and the calculation of the time to reach the ground."
    },
    {
        "index": 114,
        "Simulation_Description": "A simulation video illustrating the forces acting on the block and the calculation of the normal force exerted by the wall."
    },
    {
        "index": 115,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the object and the calculation of the spring constant."
    },
    {
        "index": 116,
        "Simulation_Description": "A simulation video illustrating the motion of the object on the inclined plane and the calculation of the coefficient of kinetic friction."
    },
    {
        "index": 117,
        "Simulation_Description": "A simulation video illustrating the ball's upward motion and the calculation of its maximum height."
    },
    {
        "index": 118,
        "Simulation_Description": "A simulation video illustrating the interaction between the two charges and the calculation of the electric force."
    },
    {
        "index": 119,
        "Simulation_Description": "A simulation video illustrating the ball's free fall and the calculation of its speed before hitting the ground."
    },
    {
        "index": 120,
        "Simulation_Description": "A simulation video illustrating the motion of the block under the applied force and the calculation of its acceleration."
    },
    {
        "index": 121,
        "Simulation_Description": "A simulation video illustrating the magnetic field generated by the current in the wire and the calculation process."
    },
    {
        "index": 122,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the block and the calculation of its maximum speed."
    },
    {
        "index": 123,
        "Simulation_Description": "A simulation video illustrating the horizontal motion of the ball and the calculation of the time to reach the ground."
    },
    {
        "index": 124,
        "Simulation_Description": "A simulation video illustrating the forces acting on the block and the calculation of the normal force exerted by the wall."
    },
    {
        "index": 125,
        "Simulation_Description": "A simulation video illustrating the forces acting on the object and the calculation of the minimum force required to overcome static friction."
    },
    {
        "index": 126,
        "Simulation_Description": "A simulation video illustrating the motion of the ball in the vertical circle and the calculation of the tension in the string."
    },
    {
        "index": 127,
        "Simulation_Description": "A simulation video illustrating the forces acting on the block and the calculation of the coefficient of kinetic friction."
    },
    {
        "index": 128,
        "Simulation_Description": "A simulation video illustrating the collision between the bullet and the block and the calculation of the average force exerted during penetration."
    },
    {
        "index": 129,
        "Simulation_Description": "A simulation video illustrating the stretching of the spring due to the hanging object and the calculation of the spring constant."
    },
    {
        "index": 130,
        "Simulation_Description": "A simulation video illustrating the vertical motion of the ball and the calculation of its maximum height."
    },
    {
        "index": 131,
        "Simulation_Description": "A simulation video illustrating the motion of the box under the applied force and the calculation of its acceleration."
    },
    {
        "index": 132,
        "Simulation_Description": "A simulation video illustrating the collision between the bullet and the block and the calculation of the bullet's initial speed."
    },
    {
        "index": 133,
        "Simulation_Description": "A simulation video illustrating the motion of the block under the applied force and the calculation of its acceleration."
    },
    {
        "index": 134,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the object and the calculation of its angular frequency."
    },
    {
        "index": 135,
        "Simulation_Description": "A simulation video illustrating the ball's free fall and the calculation of its speed before hitting the ground."
    },
    {
        "index": 136,
        "Simulation_Description": "A simulation video illustrating the elastic collision between the carts and the calculation of their velocities after the collision."
    },
    {
        "index": 137,
        "Simulation_Description": "A simulation video illustrating the motion of the block on the inclined plane and the calculation of its acceleration."
    },
    {
        "index": 138,
        "Simulation_Description": "A simulation video illustrating the sliding motion of the puck on ice and the calculation of its initial speed."
    },
    {
        "index": 139,
        "Simulation_Description": "A simulation video illustrating the vertical motion of the ball and the calculation of the time to reach maximum height."
    },
    {
        "index": 140,
        "Simulation_Description": "A simulation video illustrating the stretching of the spring and the calculation of its potential energy."
    },
    {
        "index": 141,
        "Simulation_Description": "A simulation video illustrating the ball's free fall and the calculation of its speed before hitting the ground."
    },
    {
        "index": 142,
        "Simulation_Description": "A simulation video illustrating the horizontal motion of the ball and the calculation of the distance traveled."
    },
    {
        "index": 143,
        "Simulation_Description": "A simulation video illustrating the motion of the block under the applied force and the calculation of its acceleration."
    },
    {
        "index": 144,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the mass and the calculation of its maximum speed."
    },
    {
        "index": 145,
        "Simulation_Description": "A simulation video illustrating the elastic collision between the carts and the calculation of their velocities after the collision"
    },
    {
        "index": 146,
        "Simulation_Description": "A simulation video illustrating the sliding motion of the puck down the inclined plane and the calculation of its acceleration."
    },
    {
        "index": 147,
        "Simulation_Description": "A simulation video illustrating the motion of the block under the applied force and the calculation of its acceleration."
    },
    {
        "index": 148,
        "Simulation_Description": "A simulation video illustrating the motion of the block on the rough surface and the calculation of its acceleration."
    },
    {
        "index": 149,
        "Simulation_Description": "A simulation video illustrating the upward motion of the box and the calculation of its acceleration."
    },
    {
        "index": 150,
        "Simulation_Description": "A simulation video illustrating the horizontal motion of the ball and the calculation of the distance traveled."
    },
    {
        "index": 151,
        "Simulation_Description": "A simulation video illustrating the block's motion up the frictionless inclined plane and the calculation of its acceleration."
    },
    {
        "index": 152,
        "Simulation_Description": "A simulation video illustrating the free fall of the ball and the calculation of its speed before hitting the ground."
    },
    {
        "index": 153,
        "Simulation_Description": "A simulation video illustrating the stretching of the spring by the object and the calculation of its potential energy."
    },
    {
        "index": 154,
        "Simulation_Description": "A simulation video illustrating the motion of the block on the inclined plane and the calculation of its acceleration."
    },
    {
        "index": 155,
        "Simulation_Description": "A simulation video illustrating the vertical motion of the ball and the calculation of its maximum height."
    },
    {
        "index": 156,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the mass and the calculation of its maximum speed."
    },
    {
        "index": 157,
        "Simulation_Description": "A simulation video illustrating the circular motion of the block and the calculation of tension at the bottom of its path."
    },
    {
        "index": 158,
        "Simulation_Description": "A simulation video illustrating the motion of the block down the frictionless inclined plane and the calculation of its acceleration."
    },
    {
        "index": 159,
        "Simulation_Description": "A simulation video illustrating the compression of the spring by the block and the calculation of the force exerted by the spring."
    },
    {
        "index": 160,
        "Simulation_Description": "A simulation video illustrating the free fall of the ball and the calculation of its speed before hitting the ground."
    },
    {
        "index": 161,
        "Simulation_Description": "A simulation video illustrating the circular motion of the block and the calculation of tension at the top of its path."
    },
    {
        "index": 162,
        "Simulation_Description": "A simulation video illustrating the motion of the block on the rough surface and the calculation of its acceleration."
    },
    {
        "index": 163,
        "Simulation_Description": "A simulation video demonstrating the stretching of the spring by the mass and the calculation of its potential energy."
    },
    {
        "index": 164,
        "Simulation_Description": "A simulation video illustrating the motion of the block on the rough surface and the calculation of its acceleration."
    },
    {
        "index": 165,
        "Simulation_Description": "A simulation video demonstrating the stretching of the spring by the object and the calculation of its spring constant."
    },
    {
        "index": 166,
        "Simulation_Description": "A simulation video illustrating the horizontal motion of the ball and the calculation of its travel distance."
    },
    {
        "index": 167,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the mass and the calculation of its spring constant."
    },
    {
        "index": 168,
        "Simulation_Description": "A simulation video illustrating the vertical motion of the ball and the calculation of its maximum height."
    },
    {
        "index": 169,
        "Simulation_Description": "A simulation video demonstrating the motion of the block down the frictionless inclined plane and the calculation of its acceleration."
    },
    {
        "index": 170,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the mass-spring system and the calculation of its spring constant."
    },
    {
        "index": 171,
        "Simulation_Description": "A simulation video illustrating the horizontal motion of the ball and the calculation of its travel distance."
    },
    {
        "index": 172,
        "Simulation_Description": "A simulation video demonstrating the motion of the block on the rough surface and the calculation of its acceleration."
    },
    {
        "index": 173,
        "Simulation_Description": "A simulation video illustrating the free fall of the ball and the calculation of its speed just before hitting the ground."
    },
    {
        "index": 174,
        "Simulation_Description": "A simulation video demonstrating the motion of the block up the inclined plane and the calculation of its acceleration."
    },
    {
        "index": 175,
        "Simulation_Description": "\"University Physics\" by Young and Freedman, Chapter 14."
    },
    {
        "index": 176,
        "Simulation_Description": "A simulation video illustrating the horizontal motion of the ball and the calculation of its travel distance."
    },
    {
        "index": 177,
        "Simulation_Description": "A simulation video demonstrating the motion of the block on the surface and the calculation of its acceleration."
    },
    {
        "index": 178,
        "Simulation_Description": "A simulation video demonstrating the vertical motion of the ball and the calculation of its maximum height."
    },
    {
        "index": 179,
        "Simulation_Description": "A simulation video demonstrating the motion of the block on the surface and the calculation of its acceleration."
    },
    {
        "index": 180,
        "Simulation_Description": "A simulation video illustrating the free fall of the ball and the calculation of its speed just before hitting the ground."
    },
    {
        "index": 181,
        "Simulation_Description": "A simulation video demonstrating the motion of the block on the surface and the calculation of its coefficient of kinetic friction."
    },
    {
        "index": 182,
        "Simulation_Description": "A simulation video demonstrating the vertical motion of the ball and the calculation of its maximum height."
    },
    {
        "index": 183,
        "Simulation_Description": "A simulation video demonstrating the motion of the block on the surface and the calculation of its coefficient of kinetic friction."
    },
    {
        "index": 184,
        "Simulation_Description": "A simulation video demonstrating the motion of the car and the calculation of its acceleration."
    },
    {
        "index": 185,
        "Simulation_Description": "A simulation video illustrating the horizontal motion of the ball and the calculation of its travel distance."
    },
    {
        "index": 186,
        "Simulation_Description": "A simulation video demonstrating the motion of the block down the incline and the calculation of its acceleration."
    },
    {
        "index": 187,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the mass-spring system and the calculation of its spring constant."
    },
    {
        "index": 188,
        "Simulation_Description": "A simulation video illustrating the horizontal motion of the ball and the calculation of its travel distance."
    },
    {
        "index": 189,
        "Simulation_Description": "A simulation video illustrating the motion of the block on the surface and the calculation of its acceleration."
    },
    {
        "index": 190,
        "Simulation_Description": "A simulation video illustrating the vertical motion of the ball and the calculation of the time taken to reach maximum height."
    },
    {
        "index": 191,
        "Simulation_Description": "A simulation video illustrating the oscillatory motion of the mass-spring system and the calculation of its spring constant."
    },
    {
        "index": 192,
        "Simulation_Description": "A simulation video illustrating the motion of the block up the incline and the calculation of its acceleration."
    },
    {
        "index": 193,
        "Simulation_Description": "A simulation video illustrating the free fall motion of the ball and the calculation of its final speed."
    },
    {
        "index": 194,
        "Simulation_Description": "A simulation video illustrating the horizontal motion of the ball and how the absence of vertical motion affects its trajectory."
    },
    {
        "index": 195,
        "Simulation_Description": "A simulation showing the block being pulled up the incline, with labeled forces and acceleration calculation."
    },
    {
        "index": 196,
        "Simulation_Description": "A simulation showing the ball being thrown up, slowing down, and reaching the maximum height."
    },
    {
        "index": 197,
        "Simulation_Description": "A simulation showing the object moving at 5 meter per second , then speeding up due to the applied force."
    },
    {
        "index": 198,
        "Simulation_Description": "A simulation of the pendulum swinging back and forth, showing the calculation of its period."
    },
    {
        "index": 199,
        "Simulation_Description": "A simulation illustrating the force between the charges as a function of their distance."
    }
]